{
  "projects": [
    {
      "id": 1,
      "title": "E-commerce Backend",
      "description": "Design and developed a scalable backend supporting fast product search, secure transactions, and seamless payment processing for an e-commerce platform, with Spring Boot, Lombok, JPA, Spring Security, MySQL.",
      "highlights": [
        "Designed and built a microservices-based REST API backend following test-driven development (TDD).",
        "Enhanced product search with OpenSearch ElasticSearch and improved performance via AWS Redis cache. ",
        "Implemented secure access with Bcrypt encryption, role-based access, JWT for session management, and Oauth2 authentication.",
        "Integrated Razorpay and Stripe payment gateways exercising the Strategy pattern with webhooks.",
        "Deployed on AWS Elastic Beanstalk with AWS RDS and ensured reliability through robust logging and monitoring."
      ],
      "tech": ["React", "Node.js", "MongoDB", "Stripe"],
      "githubLink": "https://github.com/itswael/productservice_proxy",
      "videoLink": "",
      "liveLink": "",
      "screenshots": [
        "/screenshots/ecommerce-2.jpg"
      ]
    },
    {
      "id": 2,
      "title": "Open Source: flickpicker",
      "description": "Contributed to an open-source project, flickpicker, template for an application for Discord movie night that can be used for a voting system. So that users can vote on through Discord, possibly Titch, or through the app/website itself",
      "highlights": [
        "Implemented the backend using Express.js and json format database for efficient saving and retrieval of movies.",
        "Integrated with in-browser caching for fast access to frequently used data.",
        "Real-time vote count updates using optimistic UI updates and async backend updates.",
        "Optimized performance by implementing pagination and lazy loading for large datasets."
      ],
      "tech": ["React", "Express", "json in-memory database"],
      "githubLink": "https://github.com/gbowne1/flickpicker",
      "videoLink": "",
      "liveLink": "",
      "screenshots": [
        "/screenshots/flickpicker-1.jpg",
        "/screenshots/flickpicker-2.jpg",
        "/screenshots/flickpicker-3.jpg"
      ]
    },
    {
      "id": 3,
      "title": "Movie Revenue Prediction",
      "description": "A machine learning project that forecasts a movie’s box office earnings, leveraging metadata (budget, cast, genre), audience sentiment (reviews, social media trends) backed by CRISP-DM methodology.",
      "highlights": [
        "Integrating data from IMDb, TMDb, Box Office Mojo, and social platforms to generate insights for studios and investors. ",
        "Utilizing NLP-based script analysis to identify key revenue predictors from movie dialogues and descriptions.",
        "Implementing models like Random Forest, XGBoost, and deep learning to improve prediction accuracy.",
        "Interactive dashboard for exploring prediction insights using streamlit"
      ],
      "tech": ["Random Forest", "XGBoost", "Deep Learning", "Python", "FastAPI"],
      "githubLink": "https://github.com/itswael/cap5771sp25-project",
      "videoLink": "https://drive.google.com/file/d/1TcVHPMGlWXuf8tRgKJTVE-B5t6e17L4-/view",
      "liveLink": "https://filmfortune.streamlit.app/",
      "screenshots": [
        "/screenshots/movie-1.jpg",
        "/screenshots/movie-2.jpg",
        "/screenshots/movie-3.jpg"
      ]
    },
    {
      "id": 4,
      "title": "GatorCan",
      "description": "Full-stack scalable educational platform enabling seamless course management, assignment submissions, and real-time collaboration for students and instructors, in Golang (gin), React.js, and SQLite. ",
      "highlights": [
        "Designed and built a robust backend with Golang, ensuring efficient user management and course enrollment workflows.",
        "Implemented a structured weekly schedule view and streamlined assignment submissions with AWS S3 storage.",
        "Developed real-time messaging channels for student-instructor and peer discussions within courses.",
        "Integrated AWS ECS for backend deployment and explored AWS RDS as a scalable database solution.",
        "Developed and integrated AI/NLP-based features for personalized course recommendations and notes summarization."
      ],
      "tech": ["React.js", "Golang", "SQLite3", "AWS"],
      "githubLink": "https://github.com/itswael/GatorCan",
      "videoLink": "https://drive.google.com/file/d/1LywboJhJ_LxYwHm6a4FTGKUGW-ZBsTMz/view",
      "liveLink": "https://gatorcan-demo.herokuapp.com",
      "screenshots": [
        "/screenshots/gatorcan-1.png",
        "/screenshots/gatorcan-2.png",
        "/screenshots/gatorcan-3.png",
        "/screenshots/gatorcan-4.png"
      ]
    }
  ]
}