{
  "timeline": [
    {
      "id": 1,
      "type": "education",
      "title": "Masters in Computer and Information Science and Engineering",
      "company": "University of Florida",
      "location": "Florida, USA",
      "startDate": "2024",
      "endDate": "2026",
      "duration": "2 years",
      "GPA": "4.0",
      "description": "Focused on Mathematics, Artificial Intelligence, Machine Learning, Data Science and Algorithms with emphasis on problem-solving and analytical thinking.",
      "achievements": [
        "Maintaining a First Class Honours (GPA: 4.0/4.0).",
        "Designed and built GatorCan, a Full-stack educational platform for seamless course management and collaboration.",
        "Developed an Object Oriented version of Pascal Programming language"
      ],
      "technologies": ["Mathematics", "Artificial Intelligence", "Machine Learning", "Data Science", "Go lang", "React.js"],
      "icon": "📚"
    },
    {
      "id": 2,
      "type": "work",
      "title": "Backend Developer",
      "company": "Tata Consultancy Services",
      "location": "Bangalore, India",
      "startDate": "Jan 2023",
      "endDate": "Aug 2024",
      "duration": "1.6 years",
      "description": "",
      "achievements": [
        ""
      ],
      "technologies": ["AI/ML", "Java", "Spring Boot", "Flask", "MS SQL", "AWS"],
      "icon": "🚀"
    },
    {
      "id": 3,
      "type": "work",
      "title": "Automation Developer",
      "company": "Tata Consultancy Services",
      "location": "Bangalore, India",
      "startDate": "Apr 2021",
      "endDate": "Jan 2023",
      "duration": "1.7 years",
      "description": "Engineered a chatbot and automation suite using Power Automate, Flask, and Python, reducing downtime by 10% and saving 800+ hours annually through cross-platform task automation. Enhanced system performance by 93% via multithreaded DB optimization and secured access with a custom Dataverse-based authorization framework, cutting admin overhead by 20%.",
      "achievements": [
        "Developed and deployed a chatbot solution leveraging Power Automate (PVA) and Flask REST API to automate key processes acrossmultiple applications, resulting in a 10% reduction in downtime.",
        "Automated repetitive tasks across mainframes, Windows, web applications, and databases using Python and Shell scripting,saving 800+ hours of manual effort annually and improving team productivity by 20%. This allowed teams to focus on higher-valuetasks, driving better business outcomes",
        "Built a custom authorization mechanism with Dataverse and Python to manage secure, role-based access across applications,ensuring compliance and reducing risks associated with unauthorized access. Resulting in smooth user access management, reducingadministrative overhead by 20%.",
        "Optimized database operations by implementing multithreading techniques, improving application performance and optimizingprocessing times by 93% (from 240 sec. to 16 sec.). This enhanced efficiency and reliability for critical business processes."
      ],
      "technologies": ["Microsoft Power Automate", "RPA", "Blueprism", "AI/ML", "MS SQL", "Oracle Db", "Dataverse"],
      "icon": "🚀"
    },
    {
      "id": 4,
      "type": "work",
      "title": "Fullstack Developer",
      "company": "Tata Consultancy Services",
      "location": "Bangalore, India",
      "startDate": "Oct 2020",
      "endDate": "Apr 2021",
      "duration": "6 months",
      "description": "Built a secure, real-time order tracking portal that reduced response time by 90%, automated 3 key workflows, and saved 720+ hours annually while cutting support tickets by 40%.",
      "achievements": [
        "Designed and developed a web-based order tracking portal using HTML, CSS, JavaScript, Node.js, and MS SQL to enable real-timeorder status tracking, reducing response time by 90% and saving 500 hours annually by eliminating manual ticket inquiries.",
        "Integrated role-based authorization and security groups to ensure secure login and compliance, minimizing related incidents by30%. Implemented robust error handling and logging, improving reliability and shrinking downtime by 15%.",
        "Optimized the order tracking process by automating manual workflows, decoupling dependency on support tickets by 40%, andimproving overall operational efficiency for end-users, saving 200 hours annually in manual effort."
      ],
      "technologies": ["React.js", "Node.js", "Express.js", "MS SQL"],
      "icon": "🚀"
    },
    {
      "id": 5,
      "type": "education",
      "title": "Bachelor of Technology",
      "company": "Dr. A. P. J. Abdul Kalam Technical University",
      "location": "Uttar Pradesh, India",
      "startDate": "2016",
      "endDate": "2020",
      "duration": "4 years",
      "description": "Comprehensive study of computer science fundamentals, software engineering, and modern programming paradigms.",
      "achievements": [
        "Graduated with First Class Honours (CGPA: 8.7/10)",
        "Designed and built apniPharmacy, a platform to collect and provide unused medicines to NGOs which then reaches to the people in need",
        "Lead a team of 5 to organize drones designing and building workshop with IIT Kanpur startup “Pi Drones”, which was first of its kind, in the campus.",
        "Lead a team of 10 to organize Codezilla, an inter-college coding hackathon.",
        "Led a team of 20 volunteers to organize hospitality services for over 600+ attendees during the Universal Human Values and Professional Ethics Conference."
      ],
      "technologies": ["Java", "Android Studio", "Firebase", "DSA","Operating System","Computer Networks", "Database Systems", "Web Development"],
      "icon": "🎓"
    }
  ]
}
